In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Used_Bikes.csv')
df.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

In [4]:
df.isnull().sum()

bike_name     0
price         0
city          0
kms_driven    0
owner         0
age           0
power         0
brand         0
dtype: int64

In [5]:
df.duplicated().sum()

25324

In [6]:
df.drop_duplicates(inplace=True)

In [7]:
df.shape

(7324, 8)

In [8]:
df.dtypes

bike_name      object
price         float64
city           object
kms_driven    float64
owner          object
age           float64
power         float64
brand          object
dtype: object

In [9]:
#we have to convert all categorical values into numerical since ML can only handle numericals

In [10]:
cat_col = df.select_dtypes(include="O")    #object datatypes are now hold into cat_Col
cat_col.head()

                              bike_name       city        owner          brand
0    TVS Star City Plus Dual Tone 110cc  Ahmedabad  First Owner            TVS
1           Royal Enfield Classic 350cc      Delhi  First Owner  Royal Enfield
2                  Triumph Daytona 675R      Delhi  First Owner        Triumph
3                  TVS Apache RTR 180cc  Bangalore  First Owner            TVS
4  Yamaha FZ S V 2.0 150cc-Ltd. Edition  Bangalore  First Owner         Yamaha

In [11]:
num_col = df.select_dtypes(exclude = "O")
num_col.head(2)

      price  kms_driven  age  power
0   35000.0     17654.0  3.0  110.0
1  119900.0     11000.0  4.0  350.0

In [12]:
#feature selection  -> select only those columns which gives valuable info rather than selecting all columns

In [13]:
cat_col = cat_col.drop(['bike_name','city'],axis=1)
cat_col

            owner            brand
0     First Owner              TVS
1     First Owner    Royal Enfield
2     First Owner          Triumph
3     First Owner              TVS
4     First Owner           Yamaha
...           ...              ...
9362  First Owner             Hero
9369  First Owner            Bajaj
9370  First Owner  Harley-Davidson
9371  First Owner            Bajaj
9372  First Owner            Bajaj

[7324 rows x 2 columns]

In [15]:
cat_col['owner'].value_counts()

First Owner             6642
Second Owner             588
Third Owner               84
Fourth Owner Or More      10
Name: owner, dtype: int64

In [16]:
dt = {"First Owner":1,"Second Owner":2,"Third Owner":3,"Fourth Owner Or More":4}
dt

{'First Owner': 1,
 'Second Owner': 2,
 'Third Owner': 3,
 'Fourth Owner Or More': 4}

In [17]:
cat_col['owner']

0       First Owner
1       First Owner
2       First Owner
3       First Owner
4       First Owner
           ...
9362    First Owner
9369    First Owner
9370    First Owner
9371    First Owner
9372    First Owner
Name: owner, Length: 7324, dtype: object

In [19]:
cat_col['owner'] = cat_col['owner'].map(dt)

In [20]:
cat_col

      owner            brand
0         1              TVS
1         1    Royal Enfield
2         1          Triumph
3         1              TVS
4         1           Yamaha
...     ...              ...
9362      1             Hero
9369      1            Bajaj
9370      1  Harley-Davidson
9371      1            Bajaj
9372      1            Bajaj

[7324 rows x 2 columns]

In [21]:
#now we have to convert brand column into numerical

In [22]:
cat_col['brand'].nunique()

23

In [23]:
cat_col['brand'].unique()

array(['TVS', 'Royal Enfield', 'Triumph', 'Yamaha', 'Honda', 'Hero',
       'Bajaj', 'Suzuki', 'Benelli', 'KTM', 'Mahindra', 'Kawasaki',
       'Ducati', 'Hyosung', 'Harley-Davidson', 'Jawa', 'BMW', 'Indian',
       'Rajdoot', 'LML', 'Yezdi', 'MV', 'Ideal'], dtype=object)

In [24]:
unique_brands = list(cat_col['brand'].unique())
unique_brands

['TVS',
 'Royal Enfield',
 'Triumph',
 'Yamaha',
 'Honda',
 'Hero',
 'Bajaj',
 'Suzuki',
 'Benelli',
 'KTM',
 'Mahindra',
 'Kawasaki',
 'Ducati',
 'Hyosung',
 'Harley-Davidson',
 'Jawa',
 'BMW',
 'Indian',
 'Rajdoot',
 'LML',
 'Yezdi',
 'MV',
 'Ideal']

In [25]:
num = 1
dt2 = {}
for i in unique_brands:
    dt2[i] = num
    num+=1

In [26]:
dt2

{'TVS': 1,
 'Royal Enfield': 2,
 'Triumph': 3,
 'Yamaha': 4,
 'Honda': 5,
 'Hero': 6,
 'Bajaj': 7,
 'Suzuki': 8,
 'Benelli': 9,
 'KTM': 10,
 'Mahindra': 11,
 'Kawasaki': 12,
 'Ducati': 13,
 'Hyosung': 14,
 'Harley-Davidson': 15,
 'Jawa': 16,
 'BMW': 17,
 'Indian': 18,
 'Rajdoot': 19,
 'LML': 20,
 'Yezdi': 21,
 'MV': 22,
 'Ideal': 23}

In [27]:
cat_col['brand'] = cat_col['brand'].map(dt2)

In [30]:
cat_col

      owner  brand
0         1      1
1         1      2
2         1      3
3         1      1
4         1      4
...     ...    ...
9362      1      6
9369      1      7
9370      1     15
9371      1      7
9372      1      7

[7324 rows x 2 columns]

In [31]:
df2 = pd.concat([cat_col,num_col],axis=1)
df2

      owner  brand     price  kms_driven  age  power
0         1      1   35000.0     17654.0  3.0  110.0
1         1      2  119900.0     11000.0  4.0  350.0
2         1      3  600000.0       110.0  8.0  675.0
3         1      1   65000.0     16329.0  4.0  180.0
4         1      4   80000.0     10000.0  3.0  150.0
...     ...    ...       ...         ...  ...    ...
9362      1      6   25000.0     48587.0  8.0  150.0
9369      1      7   35000.0     60000.0  9.0  220.0
9370      1     15  450000.0      3430.0  4.0  750.0
9371      1      7  139000.0     21300.0  4.0  400.0
9372      1      7   80000.0      7127.0  5.0  220.0

[7324 rows x 6 columns]

In [32]:
df2.isnull().sum()

owner         0
brand         0
price         0
kms_driven    0
age           0
power         0
dtype: int64

In [33]:
x = df2.drop('price',axis='columns')
y =  df2[['price']]

In [34]:
from sklearn.model_selection import train_test_split

In [35]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2)

In [36]:
x_train

      owner  brand  kms_driven   age  power
6330      1      7     33500.0   8.0  180.0
8907      1      7       350.0   4.0  200.0
5573      1      7     37000.0   8.0  100.0
9079      1      6     28000.0   9.0  100.0
2700      1      6     12510.0   4.0  150.0
...     ...    ...         ...   ...    ...
5391      1      7     10000.0   4.0  100.0
737       1      7     40000.0   9.0  150.0
5902      1      6     49000.0  14.0  223.0
1540      1      2     12000.0   9.0  500.0
1580      1     10      7500.0   4.0  390.0

[5859 rows x 5 columns]

In [38]:
from sklearn.linear_model import LinearRegression

In [39]:
lr = LinearRegression()

In [40]:
lr.fit(x_train,y_train)

LinearRegression()

In [42]:
lr.score(x_train,y_train)

0.7208202021779007

In [43]:
lr.score(x_test,y_test)

0.7168144308675242

In [46]:
prediction = lr.predict(x_test)

In [49]:
y_test['predicted_price'] = prediction

In [50]:
y_test

          price  predicted_price
4976    32000.0     16261.843411
4627   104100.0    193342.449099
2449    43100.0     25773.196192
2863    14000.0     32384.337942
8401  1100000.0    587849.672537
...         ...              ...
6155   100000.0    134655.926132
5168    82500.0     85796.171827
2691    63000.0    119596.381697
4061    28000.0     15252.576128
6887    19786.0     43418.548793

[1465 rows x 2 columns]

In [53]:
y_test['difference'] = y_test['price']-y_test['predicted_price']

In [54]:
y_test

          price  predicted_price     difference
4976    32000.0     16261.843411   15738.156589
4627   104100.0    193342.449099  -89242.449099
2449    43100.0     25773.196192   17326.803808
2863    14000.0     32384.337942  -18384.337942
8401  1100000.0    587849.672537  512150.327463
...         ...              ...            ...
6155   100000.0    134655.926132  -34655.926132
5168    82500.0     85796.171827   -3296.171827
2691    63000.0    119596.381697  -56596.381697
4061    28000.0     15252.576128   12747.423872
6887    19786.0     43418.548793  -23632.548793

[1465 rows x 3 columns]

In [57]:
from sklearn.metrics import mean_squared_error,mean_absolute_error

In [56]:
mean_squared_error(y_test['price'],y_test['predicted_price'])
#mean_sq_error should be low as much as possible

5036928915.516507

In [58]:
mean_absolute_error(y_test['price'],y_test['predicted_price'])

34301.96345254055

In [59]:
import numpy as np

In [60]:
mse = mean_squared_error(y_test['price'],y_test['predicted_price'])
mse

5036928915.516507

In [61]:
np.sqrt(mse)

70971.32460026731

In [64]:
from sklearn.metrics import r2_score

In [65]:
r2_score(y_test['price'],y_test['predicted_price'])

0.7168144308675242

In [66]:
y_test.shape[0]

1465

In [67]:
x_test.shape

(1465, 5)

In [70]:
loss = (1-0.7168144308675242)*(1465-1)/(1465-5-1)     #(1-r^2)(n-1)/(n-p-1)

In [71]:
1-loss

0.7158439525634376

In [72]:
import joblib

In [78]:
joblib.dump(lr,'linear_regression_model.lb')

['linear_regression_model.lb']